# FabricationVersionInfo Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationVersionInfo Properties
FabricationVersionInfo Class See Also
---
The FabricationVersionInfo type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Reason | The user-specified reason for the change. |
| Version | The version number of the change. |

# See Also
FabricationVersionInfo Class
Autodesk.Revit.DB Namespace